{
    "shows": [
        
        {"id": 1,
        "title":"Iron Man 1",
        "poster":"https://i.imgur.com/qPF23cX.jpeg",
        "category": "movie",
        "rentalPrice": "4.25",
        "purchasePrice": "9.25",
        "desc": "Iron Man 1 follows Tony Stark, a billionaire industrialist and genius inventor, who builds a powerful armored suit and becomes a superhero after being held captive and realizing the destructive potential of his own technology."},

        {"id": 2,
        "title":"Iron Man 2",
        "poster":"https://i.imgur.com/flPHZPo.jpeg",
        "category": "movie",
        "rentalPrice": "3.1",
        "purchasePrice": "8.95",
        "desc": "Tony Stark faces both personal and professional challenges as he grapples with his declining health, confronts a formidable new adversary in the form of Ivan Vanko, and strives to protect his technology from falling into the wrong hands."},

        {"id": 3,
        "title":"Iron Man 3",
        "poster":"https://i.imgur.com/aBQyqaT.jpeg",
        "category": "movie",
        "rentalPrice": "4.95",
        "purchasePrice": "9.4",
        "desc": "Tony Stark faces his greatest personal and technological threats yet as he battles against the enigmatic terrorist known as the Mandarin while also grappling with the aftermath of the events in The Avengers."},

        {"id": 4,
        "title":"Spider-Man: Homecoming",
        "poster":"https://i.imgur.com/TL8DMUR.jpeg",
        "category": "movie",
        "rentalPrice": "6.15",
        "purchasePrice": "11.25",
        "desc": "A young Peter Parker navigates the challenges of high school life while balancing his newfound identity as the web-slinging superhero, Spider-Man, as he faces off against the Vulture, a formidable adversary with ties to his own community."},

        {"id": 5,
        "title":"Spider-Man: Far From Home",
        "poster":"https://i.imgur.com/RIqzSCn.jpeg",
        "category": "movie",
        "rentalPrice": "6",
        "purchasePrice": "11.1",
        "desc": "Peter Parker embarks on a European vacation with his friends, only to find himself thrust into a world-saving mission when elemental creatures wreak havoc across the continent, all while grappling with his feelings for MJ and the legacy of his mentor, Tony Stark."},

        {"id": 6,
        "title":"Spider-Man: No Way Home",
        "poster":"https://i.imgur.com/WpD61Vp.jpeg",
        "category": "movie",
        "rentalPrice": "7.3",
        "purchasePrice": "11.95",
        "desc": "Peter Parker's life is turned upside down when his secret identity is exposed, leading him to seek help from Doctor Strange to erase the knowledge from the world's memory. However, a multiversal rift unleashes villains from alternate realities, forcing Peter to confront his greatest foes alongside versions of himself from other dimensions."},

        {"id": 7,
        "title":"Avengers: Infinity War",
        "poster":"https://i.imgur.com/RUw0hJR.jpeg",
        "category": "movie",
        "rentalPrice": "12.2",
        "purchasePrice": "pprice2",
        "desc": "The Avengers and their allies must unite to stop the powerful titan Thanos from collecting all six Infinity Stones, which would grant him the ability to wipe out half of all life in the universe, leading to an epic battle across multiple worlds and dimensions with the fate of existence hanging in the balance."},

        {"id": 8,
        "title":"Avengers: Endgame",
        "poster":"https://i.imgur.com/WnCals9.jpeg",
        "category": "movie",
        "rentalPrice": "7.65",
        "purchasePrice": "13",
        "desc": "The surviving members of the Avengers embark on a daring mission to reverse the devastating effects of Thanos' snap and restore balance to the universe. Through time travel and sacrifice, they confront their pasts and unite for one final showdown against Thanos in an epic battle that will determine the fate of all existence."},

        {"id": 9,
        "title":"Loki",
        "poster":"https://i.imgur.com/RKCq9SX.jpeg",
        "category": "tv",
        "rentalPrice": "5.45",
        "purchasePrice": "9.1",
        "desc": "The God of Mischief finds himself trapped in a mysterious organization known as the Time Variance Authority after stealing the Tesseract. Forced to confront his past actions and face powerful adversaries, Loki navigates a complex web of time-traveling intrigue while grappling with questions of identity and destiny."},

        {"id": 10,
        "title":"Agents of S.H.I.E.L.D.",
        "poster":"https://i.imgur.com/DMKUdqY.jpeg",
        "category": "tv",
        "rentalPrice": "3.25",
        "purchasePrice": "7.75",
        "desc": "A team of skilled agents led by Phil Coulson tackles various threats to global security, including Hydra, rogue Inhumans, and extraterrestrial forces, while navigating complex alliances, personal struggles, and the consequences of their actions in a world filled with superheroes and supervillains."},

        {"id": 11,
        "title":"Hawkeye",
        "poster":"https://i.imgur.com/JaRfEWn.jpeg",
        "category": "tv",
        "rentalPrice": "4.15",
        "purchasePrice": "8.7",
        "desc": "Clint Barton, a skilled archer and former Avenger, teams up with a young and resourceful protégé named Kate Bishop to confront challenges from his past, including powerful enemies and personal demons, while also navigating the complexities of family and friendship."},

        {"id": 12,
        "title":"WandaVision",
        "poster":"https://i.imgur.com/j01E9EV.jpeg",
        "category": "tv",
        "rentalPrice": "5.85",
        "purchasePrice": "9.2",
        "desc": "Wanda Maximoff and Vision find themselves living idyllic suburban lives in a series of sitcom-inspired realities. As they begin to question the nature of their existence, they uncover dark secrets and confront their grief and trauma, all while facing off against mysterious forces that threaten to tear apart their reality."}

    ]
}
